[M_IrisEp4_AMontage MissionDefinition]
MissionDescription="Moxxi is your new sponsor, and she's as talented at gladiatorial promotion as she is at drawing attention away from her face. And she has a plan for you..."
TurnInDescription="Your trainer, as it turns out, is your old pal Tiny Tina. (Except for the ''old'' part, because she's, like, thirteen, and maybe the ''pal'' part as well, if you don't like her very much.)"

[M_IrisEp4_CherryBomb MissionDefinition]
MissionDescription="The next highest-ranked gladiator on the Torgue leaderboards is named Motor Momma. She's hiding out in the [place]Southen Raceway[-place] and won't reveal herself to any but the most worthy of opponents.<br><br>Now that you've gotten her attention, you're free to go meet Motor Momma, and kill the living hell out of her."
TurnInDescription="Thanks to your efforts, Motor Momma is now driving across that great speedway in the sky.<br><br>Just kidding. <br><br>She's in hell."

[M_IrisEp4_TrainningWithTina MissionDefinition]
MissionDescription="Moxxi is your new sponsor, and she's as talented at gladiatorial promotion as she is at drawing attention away from her face. She feels that before you can take on the higher-ranked gladiators like Motor Momma and Flyboy, you'll need some training.<br><br>Your trainer, as it turns out, is Tiny Tina. She's asked you to head to the Torgue Arena."

[M_IrisEp4_TrainningWithTina:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi is your new sponsor, and she's as talented at gladiatorial promotion as she is at drawing attention away from her face. She feels that before you can take on the higher-ranked gladiators like Motor Momma and Flyboy, you'll need some training.<br><br>Your trainer, as it turns out, is Tiny Tina. The first part of your training, she claims, is nutrition -- you need to eat lots of chocolate chip cookies from the Torgue food dispensaries so you'll have the strength you need to take down Piston."

[M_IrisEp4_TrainningWithTina:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi is your new sponsor, and she's as talented at gladiatorial promotion as she is at drawing attention away from her face. She feels that before you can take on the higher-ranked gladiators like Motor Momma and Flyboy, you'll need some training.<br><br>Your trainer, as it turns out, is Tiny Tina. The first part of your training, she claims, is nutrition -- you need to eat lots of cookies from the Torgue food dispensaries so you'll have the strength you need to take down Piston.<br><br>After you grabbed a few cookies, however, things took a dark turn: Tina realized that the cookies you collected were not, in fact, made of chocolate chip, but of the most deceptive and infuriating cookie ingredient there is: raisins.<br><br>Angered beyond all reason, Tina has demanded that you destroy the cookie dispensers so that no one will ever have to eat another raisin cookie."

[M_IrisEp4_TrainningWithTina:StealCookies MissionObjectiveDefinition]
ProgressMessage="Steal cookies"
